{
  "Aarti Jha": "Aarti Jha is a Senior Data Scientist at Red Hat, where she develops AI-driven solutions to streamline internal processes and reduce operational costs. She brings over 6.5 years of experience in building and deploying data science and machine learning solutions across industry domains. She has been an active part of the PyData community and presented at PyData NYC 2024.",
  "Adam Hill": "Adam is the Interim Director of Data Science at ComplyAdvantage, where he leads a brilliant team tackling financial crime with advanced analytics, large-scale systems, and the latest in generative and agentic AI. Before that, he spent eight years in the smart cities space at HAL24K, helping governments and infrastructure providers make better decisions with their data. Along the way, he built and led a team of ten data scientists, and helped launch four spin-out ventures—proving that good data science can move the dial in the real world. A recovering astrophysicist, Adam spent a decade analysing data from space telescopes in search of new cosmic phenomena. He’s since redirected that curiosity toward Earth-based problems. Adam is an active member of the PyData community, the founder of PyData Southampton, and a long-time volunteer with DataKind UK, supporting charities and NGOs with pro-bono data science.",
  "Agustin Iniguez": "Agustin Iniguez is a data scientist with a background in physics. For the past few years, he has been working at Rabobank, bridging the gap between engineering and data science. He specializes in model monitoring and performance optimization, with a strong background in statistical analysis and data visualization. Currently, he focuses on integrating advanced analytics into deployment pipelines to ensure robust model performance.",
  "Antonino Ingargiola": "Antonino Ingargiola is currently Lead AI Architect at Agile Lab where he oversees AI initiatives and projects in large enterprises. Previously was co-founder and CTO @ smartFAB a startup offering an advanced analytics solution for the manufacturing industry. In the past he worked as associated scientist at UCLA (California, USA) combining Machine Learning and biophysics. Antonino holds a Ph.D. in Information Technology and MD in Electronics Engineering both from Politecnico di Milano (Italy).",
  "Antonio Castelli": "Senior Machine Learning Scientist @Booking.com Ph.D. in Particle Physics My focus is the evaluation of LLMs and LLM-agents.",
  "Arda Kaygan": "",
  "Bauke Brenninkmeijer": "I’m an experienced AI engineer, having built ML and AI projects in a variety of industries. After working for several start-ups, I transitioned to corporate, where I learned about the challenges of large organisations when executing tasks that require multiple skillsets, and whether those skillsets should be centralized or not. I’m focused on scalable solutions that drive clear and quantifiable business impact. I’m a builder that sometimes does research. Or a researcher who sometimes builds. My next chapter brings me back to the world of startups, where all skills are one person. Simple but chaotic. My current focus is on building LLM applications, managing the exponential complexity of frameworks and LLM providers. Find me to chat about MCP and multi-agent orchestration. Or anything else LLM.",
  "Başak Eskili": "Basak Eskili is a Sr. Machine Learning Engineer with over 7 years of experience building ML systems across banking, retail, and travel. She holds a Bachelor’s degree in Computer Science and a Master’s degree in Artificial Intelligence, and currently works at Booking.com. She is also the co-founder of Marvelous MLOps, where she creates online courses and writes about MLOps.",
  "Benjamin Bossan": "Machine Learning Engineer at Hugging Face",
  "Chris Laffra": "Chris Laffra is a seasoned professional with extensive experience in leadership, communication, and technology. Having worked at leading tech companies like Google and Uber, as well as major financial institutions such as Bank of America and JP Morgan, Chris has built a career focused on fostering effective communication and leadership within engineering teams. Chris is also an accomplished author, with books on communication that cater specifically to engineers, aiming to make them more effective, productive, impactful, and happy in their roles. Additionally, Chris has taught numerous day-long masterclasses that delve into these topics, empowering engineers to excel both individually and as part of a team.",
  "Dana Arsovska": "Dana is a Platform Engineer at Ahold Delhaize, where she works on the technical and organizational challenges of building reliable and scalable data platforms. Her career spans over 8 years, working on cloud infrastructure, platform engineering, and data engineering in various companies. She is especially passionate about data-intensive systems, platform automation, and engineering culture. Beyond her technical expertise, Dana enjoys mentoring and sharing knowledge within the tech community and contributing to open-source.",
  "Danica Fine": "Danica began her career as a software engineer in data visualization and warehousing with a business intelligence team where she served as a point-person for standards and best practices in data visualization across her company. In 2018, Danica moved to San Francisco and pivoted to backend engineering with a derivatives data team which was responsible for building and maintaining the infrastructure that processes millions of financial market data per second in near real-time. Her first project on this team involved Kafka Streams and Kafka Connect. From there, she immersed herself in the world of data streaming and found herself quite at home in the Apache Kafka and Apache Flink communities. She now leads the open source advocacy efforts at Snowflake, supporting Apache Iceberg and Apache Polaris (incubating). Outside of work, Danica is passionate about sustainability, increasing diversity in the technical community, and keeping her many houseplants alive. She can be found on X (Bluesky and Mastodon), talking about tech, plants, and baking @TheDanicaFine.",
  "Demetrios Brinkmann": "Demetrios is the founder of the largest community dealing with productionizing AI and ML models. Since April 2020 he has been leading the @MLOps community where more than 75k ML practitioners come together to learn and share experiences, bringing clarity around the operational side of Machine Learning.",
  "Denis Gaitan": "Denis Gaitan is an accomplished IT Specialist with a history in the software industry since 2012. Over the past five years, he has specialized in the field of data science, leveraging his extensive software expertise and craftsmanship. Two years ago, he joined Rabobank as a Software Engineer, where he continually broadens his knowledge by addressing challenges from diverse perspectives. As a problem-solver, he consistently goes above and beyond for clients, excelling in new environments through his adaptability and flexibility.",
  "Dick Abma": "As a physicist, I enjoy solving real-world problems. My analytical approach is based on years of experience in modelling, programming and cloud development. I want to find durable and smart solutions, so that companies stay competitive and at the same time contribute to society. To establish new data driven solutions that work, I employ DevOps practices. This implies writing production-ready code, focusing on frequent releases, and creating a learning culture within the team.",
  "Dima Baranetskyi": "Dima Baranetskyi is a Technical Lead and Senior Data Engineering Consultant with a background in software and data engineering. He currently leads Python development in the financial sector and has designed and built production-grade streaming architectures in domains like energy, e-commerce, and education. His work focuses on event-driven systems, pragmatic data tooling, and making distributed systems understandable and maintainable. Dima is certified in Apache Kafka and Kubernetes and prefers practical, right-sized solutions over theoretical complexity.",
  "Dr. Maria Börner": "Dr. Maria Börner holds a Ph.D. in physics from CERN and DESY and is an expert in the field of AI. She is the head of the AI Competence Center at Westernacher Solutions. In this position, she is responsible for developing AI tools for government, church, and justice organizations. She strengthens the company's internal AI comptences and promotes them externally. She is also the deputy chairwoman of the Legal Tech working group at Bitkom and the German ambassador of the Women in AI network. Maria has worked in the field of AI for over eight years, focusing on responsible and ethical AI.",
  "Evertjan Peer": "Evertjan Peer is a Tech Lead at KickstartAI, where he focuses on delivering business impact through accelerating AI adoption. With a passion for solving real-world problems, he has extensive experience in machine learning and AI. Evertjan holds Master's degrees in Computer Science and Engineering and Operations Management & Logistics from Eindhoven University of Technology. His background includes roles as a Senior ML Engineer at Zalando, where he worked on fashion recommendations and customer value prediction, and as a Co-Founder of voam, a voice interface startup.",
  "Fabio Lipreri": "I am a Data Scientist with a computer science background. I love solving hard problems using math, statistics and machine learning with a special attention to the best practices of software engineering. Since my university years, Python has been my faithful ally in my challenges. I hold a master's degree in computer science from University of Milan. After graduation, I performed research internships at CERN and Karolinska Institutet. I am now an AI Engineer at xtream, a boutique firm applying academic research to business problems.",
  "Florenz Hollebrandse": "Florenz Hollebrandse is a senior leader in Data & Analytics at ING, one of the largest banks in Europe. In his role he is responsible for all analytical solutions within know-your-customer (KYC) services and financial transactions monitoring. One of the key themes in his work is executing ING's technology strategy by building a globally scalable bank through scalable technology. Florenz previously held AI/ML positions at JPMorganChase.",
  "Fokko Driesprong": "Fokko Driesprong is a Staff Open Source Software Engineer at Databricks. He is an Apache Software Foundation member and serves as a committer and PMC on major Apache projects; Avro, Parquet and Iceberg. He's one of the original authors of PyIceberg, a pure Python library to query Iceberg tables, which has over 400k daily downloads. He studied distributed systems at the University of Groningen and now specializes in building scalable cloud-based data pipelines and analytics solutions.",
  "Gabriele Orlandi": "AI scientist working at xtream",
  "George Chouliaras": "Experienced AI practitioner with more than 7 years of experience in building and deploying AI systems. I have a particular interest in Software Quality for AI systems, development & evaluation of GenAI systems .",
  "Gerben Dekker": "Gerben is passionate about driving the transition to a sustainable power system. Over 15 years in renewable energy, he transitioned early in his career from consulting to data scientist and machine learning engineer roles, specializing in power systems, electricity markets, wind power, and grid operations across multiple companies. With a strong interest in software engineering design, he has served as both a data scientist and tech lead. He now works at Dexter, where he tackles complex cross-team projects spanning engineering, data science, and energy domain expertise. Dexter provides forecasting and trading services for renewable players in short-term power markets. Gerben holds an MSc in Electrical Engineering from Eindhoven University of Technology.",
  "Gergely Daroczi": "Gergely Daroczi, PhD, is a passionate R/Python user and package developer for two decades. With over 15 years in the industry, he has expertise in data science, engineering, cloud infrastructure, and data operations across SaaS, fintech, adtech, and healthtech startups in California and Hungary, focusing on building scalable data platforms. Gergely maintains a dozen open-source R and Python projects and organizes a tech meetup with 1,800 members in Hungary – along with other open-source and data conferences.",
  "Hannes Mühleisen": "",
  "Inge van den Ende": "At Dexter Energy, Inge, a data scientist, is developing machine learning-powered products for short-term power trading optimization. Involved since the start of the product, she contributes to probabilistic time series forecasts and overall product development.",
  "Irene Donato": "Irene Donato is a Data Scientist at Agile Lab with a PhD in Mathematics and a background in Physics. She specializes in AI strategy. With experience across academia and industry, Irene focuses on applying data science to solve complex business problems.",
  "Iryna Kondrashchenko": "Iryna is a data scientist and co-founder of DataForce Solutions GmbH, a company specialized in delivering end-to-end data science and AI services. She contributes to several open-source libraries, and strongly believes that open-source products foster a more inclusive tech industry, equipping individuals and organizations with the necessary tools to innovate and compete.",
  "Isabelle Donatz-Fest": "Isabelle Donatz-Fest is advisor in responsible data practices & AI at The Green Land. In 2025, she obtained her PhD at Utrecht University. In her research, she studied responsible design & use of algorithmic systems by the Netherlands Police, spending > 350 hours with the police to observe systems in their natural habitat. Isabelle gets excited about trans- and interdisciplinary research, dinosaurs and discodip, amongst other things.",
  "Itzel Belderbos": "Machine Learning Scientist at Adyen",
  "Iva Gornishka": "Iva is a data scientist at the City of Amsterdam, where she researches the responsible use of AI for municipal use cases. Her current work focuses on benchmarking Large Language Models to promote the adoption of more diverse open-source models and to help reduce the negative societal and environmental impacts of technology.",
  "Jaap Stefels": "Machine Learning Scientist at Adyen",
  "Javier de la Rúa Martínez": "Javier is a Research Engineer at Hopsworks, where he actively contributes to advancing the Hopsworks AI Lakehouse. He is currently pursuing his Ph.D. at KTH Royal Institute of Technology in Sweden with a primary focus on large-scale machine learning systems.",
  "Jeroen Janssens": "Jeroen Janssens, PhD, is a Senior Developer Relations Engineer at Posit, PBC. His expertise lies in visualizing data, implementing machine learning models, and building solutions using Python, R, JavaScript, and Bash. He’s passionate about open source and sharing knowledge. He’s the author of Python Polars: The Definitive Guide (O’Reilly, 2025) and Data Science at the Command Line (O’Reilly, 2021). Jeroen holds a PhD in machine learning from Tilburg University and an MSc in artificial intelligence from Maastricht University. He lives with his wife and two kids in Rotterdam, the Netherlands.",
  "Joanna Pasiarska": "I am a Master student of Artificial Intelligence and Medical Informatics. My expertise ranges from data science and in-depth data analysis to creating human-centred interfaces and intuitive designs. In my work, I highly value developing transparent and explainable systems. I worked with various data types from different domains, including medical records.",
  "Judith Dijk": "Judith Dijk has more than 25 years of experience in the field of Imaging and Artificial Intelligence. The focus of her research is generation of situation awareness of complex, open scenes using camera systems. Two typical applications for this are autonomous systems and camera systems for defense applications. She prefers to work on applied science, between fundamental research and application. Her ambition is to combine possibilities and results from different disciplines to generate innovations with both scientific value and added value in practice. Until recently, Judith was a research scientist at TNO, where she defined the research projects and started collaboration with national and international partners on these topics. Since September 2024 she works at the European Defence Agency (EDA) as project officer Optronics.",
  "Judith Redi": "CTO at Creative Fabrica",
  "Konstantinos Tsoumas": "Konstantinos is a data scientist currently working at Mars with over 3,5 years of experience in the Data Science industry. Notably, is trying to prove and speak loud about model uncalibrated results.",
  "Laurens Samson": "Laurens Samson leads a development team at the City of Amsterdam that guides the implementation of LLMs across municipal departments while benchmarking Dutch-speaking language models on metrics such as bias, truthfulness, and sustainability to ensure responsible and ethical use. In parallel, he is pursuing a PhD in Safety in Multimodal Large Language Models at the University of Amsterdam, focusing on safety in multimodal generative models.",
  "Lenar Sharipov": "Lenar Sharipov is a Tech Lead at JetBrains, working on the AI Toolkit team. He builds tools for PyCharm and other IDEs that help Python developers create AI-powered solutions, such as AI agents. His focus areas include profiling, performance optimization, and improving the developer experience.",
  "Lisette van der Zande": "Lisette van der Zande is a researcher at Topigs Norsvin. She holds a Master’s degree in Animal Breeding and Genetics and a PhD in Animal Physiology, both from Wageningen University. Her doctoral research focused on developing computer vision models to assess the health status of pigs. At Topigs Norsvin, she continues this work by applying computer vision techniques to develop traits related to animal welfare.",
  "Maarten de Ruiter": "Maarten de Ruiter is a Data Scientist at Xomnia, specializing in developing and deploying GenAI applications, most recently focusing on practical governance tools. With a background in Econometrics and Philosophy, he brings both technical expertise and a critical, inquisitive mindset to his work. Maarten has delivered AI-driven solutions across healthcare, logistics, and telecom sectors, and is active in the AI Ethics community. He has contributed to several initiatives and co-authored the paper, 'The AI Ethics Maturity Model: A Holistic Approach to Advancing Ethical Data Science in Organizations.' Outside of work, Maarten enjoys reading, cooking, and exploring Europe by road bike.",
  "Mahima Arora": "Mahima Arora is a Senior Data Scientist on the Data & AI team at Red Hat, specializing in Generative AI applications. She develops AI-powered solutions that enhance efficiency and effectiveness, leading initiatives to optimize AI systems for greater impact. An open-source enthusiast, Mahima continuously explores new tools and technologies to expand her expertise and stay at the forefront of innovation.",
  "Manu Joseph": "Manu S.Joseph is a Software Engineer at Hopsworks, where he works on advancing the Hopsworks AI LakeHouse. He did his Masters in Computer Science with a specialization in Artificial Intelligence at Linköping University.",
  "Manuel Spierenburg": "Manuel Spierenburg is a Data Engineer with a background in software engineering and data science. He's worked with many different languages and tools across various industries, making him a Swiss army knife in the data world. He delivers pragmatic and elegant solutions that create real impact. When Manuel isn't crunching numbers, he's spending time with his family, including his two kids, or learning new tricks on a skateboard.",
  "Marc Duiker": "Marc is a Sr Developer Advocate at Diagrid and enjoys sharing knowledge on how to build distributed applications. He's one of the Dapr Community Managers, and he loves helping developers to achieve more every day. You might have seen Marc at a developer meetup or conference, since he's a regular speaker and event-organizer in the area of Dapr, Azure cloud, and serverless technologies. From 2019 to 2025 Marc received the Microsoft Azure MVP award for his community contributions. In his spare time, Marc likes to give attention to the creative part of his brain. He likes to create pixel art (check out VSCode Pets), code visuals & music, and create an occasional retro game.",
  "Maria Bader": "As a Senior Data Scientist at Mollie, Maria has transitioned from data nerd to AI whisperer. By delivering many AI solutions to real-world challenges for customers and colleagues alike, she has gained deep expertise in building responsible and reliable AI integrations in production. Maria looks forward to sharing her insights and experiences with you.",
  "Marten koopmans": "After a PhD in computational physics, Marten transitioned from modelling solar cells to evaluating ML systems. He now works on building and assessing open-source retrieval pipelines at Sopra Steria.",
  "Martin O'Hanlon": "Martin is an experienced computer science educator and open source software developer. Martin creates educational content for Neo4j and supports developers in using graph technology to understand their data. As a child he wanted to be either a Computer Scientist, Astronaut or Snowboard Instructor.",
  "Marysia Winkels": "Marysia is a Member of Technical Staff at Cohere, where she focusses on data quality for post-train data. She is also a former organising member of PyData Amsterdam, and frequently attends and speaks at conferences.",
  "Miguel Leite": "I’m an ML Scientist fighting fraud at Adyen. I also help implementing software engineering best practices in ML projects/teams.",
  "Mingxuan Zhao": "Mingxuan Zhao Open-Source Software Developer and Developer Advocate at IBM Ming Zhao is an open-source developer and Developer Advocate at IBM Research, where he helps IBM leverage open technologies while building impactful tools and growing vibrant open-source communities. He’s passionate about making open tech accessible to all and ensuring developers have the tools they need to succeed in the rapidly developing AI space. Ming now leads community efforts around Docling, IBM’s fastest-growing open-source project, recently welcomed into the LF AI & Data Foundation.",
  "Muhammad Chenariyan Nakhaee": "I am an AI specialist at Exact, where I work with Python during the day. In my spare time, I explore my true passion for creating graphs and visualizations with R and ggplot2. I am currently developing a data visualization project inspired by the bold aesthetics of Soviet posters and design.",
  "Nazlı Alagöz": "I’m a data scientist at Booking.com, where I work on applying causal inference and machine learning to solve business problems and support decision-making. I have a Ph.D. in quantitative marketing, with a background in econometrics and experimental design. My work sits at the intersection of economics and data science, and I enjoy using data to uncover actionable insights and understand real-world behavior.",
  "Netesh": "Netesh Bhatt is a seasoned data scientist with over 10 years of experience driving transformative business solutions through advanced analytics and machine learning. At Booking.com, he has focussed on implementing observational causal inference methods using advanced machine learning approaches to estimate incremental CLV across customer actions.",
  "Niels Neerhoff": "",
  "Ninghang Hu": "Director of AI & Ad Tech at Tencent",
  "Oleh Kostromin": "I am a Data Scientist primarily focused on Deep Learning and MLOps. In my spare time I contribute to several open-source python libraries.",
  "Omar Hommos": "Engineering Lead at Adyen",
  "Oscar Ligthart": "I am a technical lead within the data platform team at Vinted, building tooling to empower our users to create data products. With over 6 years of experience in software engineering, I am passionate about automating pipelines within the world of data.",
  "Pablo Estevez": "Pablo Estevez leads Data and Machine Learning in Eneco’s Energy Trading teams. For more than ten years he has worked across tech, taking on both hands-on and leadership roles in Machine Learning and Data Science at companies like Booking.com and Meta",
  "Panos Alexopoulos": "Panos Alexopoulos is a semantic technologies expert with nearly two decades of experience in knowledge graphs, ontology engineering, and data semantics. As of April 2025, he serves as Lead Semantic Data & AI Solutions at Triply, a semantic data integration company, after nine years as Head of Ontology at Textkernel in Amsterdam, where he led the development of a large cross-lingual knowledge graph in the HR and recruitment domain. Panos holds a PhD in Knowledge Engineering and Management from the National Technical University of Athens and he is the author of *Semantic Modeling for Data: Avoiding Pitfalls and Breaking Dilemmas* (O'Reilly, 2020), a practical guide for building high-quality semantic data models. He is also also a seasoned educator, delivering training programs on topics like knowledge graphs and large language models.",
  "Panos Vagenas": "AI Engineer at IBM Research, leading development efforts at the intersection of Artificial Intelligence, Information Retrieval, and Data Management.",
  "Paul verhaar": "With a background in computational linguistics and a strong link to academia, Paul leads our DS & AI team. He focuses on practical, agnostic LLM applications with a strong open-source flavour.",
  "Raphael Mitsch": "I'm a machine learning engineer, these days mostly working in natural language processing. I have soft spots for data visualization, interpretable ML, and the decentralization of AI. I build NLP systems for a living. Occasionally they work. I don't believe that attention is all we need. What I do believe in: pragmatism, taking a deep breath before falling for the next hype, and touching grass.",
  "Rik Nuijten": "Rik Nuijten is a Data Scientist at Solynta (a hybrid potato breeding company). His expertise lies in geospatial analysis, with a focus on data collected from drones. At his current company they are constantly learning about the new potato plants they create. Rik enjoys developing workflows to capture plant information using sensor data, specifically when it is otherwise difficult to observe through field surveys. He finds the biggest challenges in finding areas where such workflows add most value for the company and in finding ways to keep data collection protocols and analysis simple. Rik holds a PhD in Forestry and Remote Sensing from the University of British Columbia. Outside of work, Rik enjoys all sports that do not require good hand-eye coordination, including biking, hiking, and bouldering as well as a nice cinnamon bun afterward.",
  "Rob Zinkov": "Rob Zinkov is a machine learning engineer and data scientist. My work covers how to more efficiently specify and train deep generative models as well as how to more effectively discover a good statistical model for your data. I am Principal Data Scientist at PyMC Labs. Previously I was a research scientist at Indiana University where I was the lead developer of the Hakaru probabilistic programming language.",
  "Rodrigo Loredo": "With over 8 years of experience working with data, I've explored various roles. Currently, I work as a Lead Analytics Engineer at Vinted's Data Platform team, where we build and maintain tooling that supports over 200 data professionals in creating and orchestrating data products. My linguistics background helps me connect technical precision with clear concepts and drive impactful solutions.",
  "Sayak Paul": "Sayak works on diffusion models at Hugging Face. His day-to-day includes training and babysitting diffusion models for images and videos, working on the diffusers library, and collaborating on applied research ideas. Off the work, he likes to binge-watch Suits and ICML tutorials.",
  "Shimanto Rahman": "Hi, I am Shimanto Rahman a PhD student at Ghent University. In my PhD I specialize in measuring machine learning models as close to the business goals as possible. For that my research interests are in cost-sensitive learning and profit-driven analytics. My way to procrastinate on my PhD is building Empulse.",
  "Shourya Sharma": "I like to build smart AI systems that solve smart business problems.",
  "Simon Brugman": "",
  "Sven Arends": "Sven Arends is a Senior Machine Learning Engineer at Picnic, where he is currently developing novel LLM applications. With a strong background in machine learning and software engineering, Sven has contributed to a wide range of projects: from predicting delivery times to forecasting buying behaviour and implementing MLOps tooling within Kubernetes. He holds a Master’s degree in Computer Science. In his free time, Sven enjoys creating small embedded devices or visiting the sauna: a tradition he adopted during his time in Finland.",
  "Thijs Nieuwdorp": "Thijs Nieuwdorp is the Lead Data Scientist at Xomnia in Amsterdam. His interest in the interaction between human and computer led him to an education in Artificial Intelligence at the Radboud University, after which he dove straight into the field of Data Science. At Xomnia he witnessed the birth of Polars as Ritchie Vink started working on it during his employment there and has been using it in his projects ever since. He enjoys figuring out complex data problems, optimizing existing solutions, and putting them to good use by implementing them into business processes. Outside work Thijs enjoys exploring our world through hiking and traveling, and exploring other worlds through books, games, and movies. He lives in Amsterdam with his partner, Paula.",
  "Tomek Roszczynialski": "Tomek is a data scientist and machine learning developer with a background in, and a passion for, physics. He has been involved in multiple data-heavy projects, from setting up signal processing pipelines handling data from thousands of cardiology patients to building industrial automation software in Polish cement plants. In his spare time, Tomek trains multi-billion-parameter transformer models to play progressive piano music.",
  "Vincent Warmerdam": "Vincent is a senior data professional who worked as an engineer, researcher, team lead, and educator in the past. You might know him from tech talks with an attempt to defend common sense over hype in data science. He is especially interested in understanding algorithmic systems so that one may prevent failure. As such, there has always been a preference for simpler solutions that scale, as opposed to the latest and greatest from the tech industry. Vincent is also well known for creating a lot of open-source packages, some of which have been downloaded over a million times. He's also well known for his calmcode.io project, as well his blog over at koaning.io.",
  "Vitalie Spinu": "As a machine learning scientist at Adyen, my current focus lies in the development of models and explainability tooling for monitoring of Adyen's payment processes. My primary areas of interest comprise Bayesian probabilistic modeling, machine learning explainability, and causality. In my past roles as a freelance professional, employed data scientist and university researcher, I have engaged with a wide array of applied modeling challenges, such as churn modeling, matching engines, anomaly detection, recommender systems and modeling of human behavior under risk.",
  "Vitalii Zhebrakovskyi": "Vitalii Zhebrakovskyi is Senior Software Engineer at Adyen working in fraud prevention and MLOps fields. He's the major contributor to Adyen's Feature Platform with primary focus on stream processing with Apache Flink. His career spans over more than 20 years and wide variety of domains and languages with lately focusing on Java and Payment Processing field.",
  "Wesley Boelrijk": "Wesley is a Senior Data Scientist at KLM Royal Dutch Airlines, where he develops next-generation demand forecasting models with a strong focus on time series. Previously, he led a Machine Learning traineeship at Xccelerated (Xebia), mentoring engineers and scientists through tutoring and live coding, alongside various consultancy projects. A three-time PyData speaker, Wesley is passionate about Bayesian modeling and making forecasting techniques practical. He holds master’s degrees in Econometrics (VU Amsterdam) and Engineering & Policy Analysis (TU Delft), and a bachelor’s in Aviation Engineering. Outside of work, he is a devoted Formula 1 fan, fascinated by the sport’s rich data streams and the opportunities they create for advanced modeling. He has attended Grands Prix in Zandvoort, Spa, and Spielberg.",
  "Yaroslav Sokolov": "Yaroslav Sokolov leads the development of the AI Toolkit at JetBrains. He previously worked as a machine learning engineer, building the local deep learning models behind full line code completion – the main source of AI-powered code suggestions in JetBrains IDEs. His current focus is on building tools that promote best ML practices while remaining intuitive and accessible for developers without a machine learning background.",
  "Yuliya Sapega": "A practical AI professional with 14+ years of expertise in Data Science, Analytics, Engineering, and AI, along with 5 years in leadership roles. Combines technical expertise with business acumen, gained from working with complex organizations such as IKEA, KLM, KPN, the City of Rotterdam, AON, and ING. Focusing on designing and integrating practical AI solutions that align with your organization’s objectives."
}